Repository: LogExperts/LogExpert
Catalog: src/LogExpert.Resources/Resources.*.resx
Languages: de

# Program_UI_Error_ConfigFileNotFound
source: Config file not found
de: Konfigurationsdatei konnte nicht gefunden werden

# Program_UI_Error_InsufficiantRights
source: Insufficient system rights for LogExpert. Maybe you have started it from a network drive. Please start LogExpert from a local drive.\n ({0})
de: LogExpert besitzt nicht alle Systemrechte. Vielleicht wurde LogExpert aus einem Netzwerklaufwerk gestartet. Bitte LogExpert von einem lokalen Laufwerk starten!\n ({0})

# Title_LogExpert_Error
source: LogExpert Error
de: LogExpert Fehler

# Program_Logger_Error_Pipe_TimeoutException
source: Timeout connecting to pipe server
de: Beim versuch den Pipe-Server zu erreichen kam es zu einem Timeoutfehler

# Program_Logger_Warn_Error_Pipe_IOException
source: An I/O error occurred while connecting to the pipe server: {0}
de: Beim Versuch den Pipe-Server zu erreich kam es zu einem I/O Fehler: {0}

# Program_Logger_Warn_Pipe_UnauthorizedAccessException
source: Unauthorized access while connecting to the pipe server: {0}
de: Beim Versuch den Pipe-Server zu erreich kam es zu einem Zugriffsfehler: {0}

# Program_Logger_Warn_Pipe_CommonError
source: Pipe server error: {0}
de: Pipeserver Fehler: {0}

# Program_Logger_Error_Payload_InvalidCommand
source: Invalid payload command: null
de: Falsche Payload: null

# Program_UI_Error_Pipe_CannotConnectToFirstInstance
source: Cannot open connection to first instance ({0})
de: Die Verbindung zur ersten Instanz kann nicht geöffnet werden: {0}

# Program_Logger_Error_MutexError
source: Mutex error, giving up: {0}
de: Problem beim Mutex, Program wird beendet: {0}

# Program_Logger_Error_IPCChannel_ClientError
source: IpcClientChannel error, giving up: {0}
de: Fehler des IPC Client Channels, Program wird beendet: {0}

# Program_Logger_Error_IPCChannel_ClientError_Default
source: IpcClientChannel error: {0}
de: Fehler des IPC Client Channels: {0}

# Program_Logger_Warn_Pipe_InvalidOperationException
source: Invalid Operation while connecting to the pipe server: {0}
de: Eine invalide Operation wurde durchgeführt, während des Verbindungsversuches zum Pipeserver: {0}

# LogExpertProxy_Logger_Info_LoadingFilesIntoLogTab
source: Loading files into existing LogTabWindow
de: Laden der Dateien in einen existierendes LogTabWindow

# LogExpertProxy_Logger_Warn_GUIThreadDisposedSettingNewOne
source: first GUI thread window is disposed. Setting a new one.
de: Erstes Fenster wurde geschlossen. Ein neues wird erstellt.

# LogExpertProxy_Logger_Info_NoWindowsLeftCreatingNewOne
source: No windows left. New created window will be the new 'first' GUI window
de: Kein offenes Fenster übrig. Ein neues Fenster wird erstellt es wird als primäres GUI Fenster benutzt

# LogExpertProxy_Logger_Info_CreatingNewWindow
source: Creating new LogTabWindow
de: Neues LogTabWindow erstellen

# LogExpertProxy_Logger_Info_LastTabWindowClosed
source: Last LogTabWindow was closed
de: Das letzte LogTabWindow wurde geschlossen

# LogExpertProxy_Logger_Info_AddWindow
source: Adding window to list
de: Fenster wird zur Liste hinzugefügt

# LogExpertProxy_Logger_Info_RemoveWindow
source: Removing window from list
de: Fenster wird aus der Liste entfernt

# HighlightDialog_UI_SettingsImported
source: Settings imported
de: Einstellungen importiert

# HighlightDialog_Logger_Error_FileAccessError
source: Error while trying to access file: {0}, exception: {1}
de: Fehler während des Zugriffes auf die Datei: {0}, Fehlermeldung: {1}

# HighlightDialog_UI_SettingsCouldNotBeImported
source: Settings could not be imported: {0}
de: Einstellungen konnte nicht importiert werden: {0}

# HighlightDialog_UI_Title_ExportSettings
source: Export Settings to file
de: Exportieren der Einstellungen in eine Datei

# HighlightDialog_UI_Export_Filter
source: Settings (*.json)|*.json|All files (*.*)
de: Einstellungen (*.json)|*.json|Alle Dateien (*.*)

# HighlightDialog_UI_Snippet_CopyOf
source: Copy of
de: Kopie von

# HighlightDialog_UI_NewGroup_BaseName
source: New group
de: Neue Gruppe

# HighlightDialog_Logger_Error_ErrorDuringAddOfHighLightEntry
source: Error during add of highlight entry: {0}
de: Fehler während des Hinzufügens eines Highlighteintrages: {0}

# HighlightDialog_UI_ErrorDuringAddOfHighLightEntry
source: Error during add of entry.\r\n{0}
de: Fehler während des Hinzufügens eines Highlighteintrages.\r\n{0}

# HighlightDialog_RegexError
source: Regex value is null or whitespace
de: Die Regex ist "null" oder besteht nur aus Leerzeichen

# HighlightDialog_Logger_Error_ErrorDuringSavingOfHighlightEntry
source: Error during save of save highlight entry: {0}
de: Während des Speichern des Highlighteintrages ist ein Fehler aufgetreten: {0}

# HighlightDialog_UI_ErrorDuringSavingOfHighlightEntry
source: Error during save of entry.\r\n{0}
de: Während des Speichern des Highlighteintrages ist ein Fehler aufgetreten: {0}

# ConfigManager_Logger_Info_LoadingSettings
source: Loading settings
de: Laden der Einstellungen

# ConfigManager_Logger_Info_LoadSettingsStandardMode
source: Load settings standard mode
de: Laden der Einstellungen im Standard Modus

# ConfigManager_Logger_Info_LoadSettingsPortableMode
source: Load settings portable mode
de: Laden der Einstellungen im portablen Modus

# ConfigManager_Logger_Error_FileSystemErrorExMessage
source: File system error: {0}
de: Filesystem Fehler: {0}

# ConfigManager_Logger_Error_AccessDeniedExMessage
source: Access denied: {0}
de: Zugriff verweigert: {0}

# ConfigManager_Logger_Error_UnexpectedErrorExMessage
source: Unexpected error: {0}
de: Unerwarteter Fehler: {0}

# ConfigManager_Logger_Error_ErrorWhileDeserializingConfigData
source: Error while deserializing config data: {0}
de: Fehler während der Deserialisierung der Konfigurationsdaten: {0}

# ConfigManager_Logger_Info_SavingSettings
source: Saving settings
de: Speichern der Einstellungen

# PaintHelper_HeaderText_LineNumberColumn
source: Line
de: Zeile

# Lockfinder_Exception_CouldNotListProcessesLockingResourceFailedToGetSizeOfResult
source: Could not list processes locking resource. Failed to get size of result.
de: Die Liste der Prozesse, die, die Ressource sperren, kann nicht angezeigt werden. Die Länge des Resultats konnte nicht gefunden werden.

# Lockfinder_Exception_CouldNotListProcessesLockingResource
source: Could not list processes locking resource
de: Die Liste der Prozesse, die, die Ressource sperren, kann nicht angezeigt werden

# Lockfinder_Exception_CouldNotRegisterResource
source: Could not register resource.
de: Die Ressource kann nicht registriert werden.

# Lockfinder_Exception_CouldNotBeginRestartSessionUnableToDetermineFileLocker
source: Could not begin restart session. Unable to determine file locker.
de: Die Session konnte nicht neu gestartet werden. Die Dateisperre konnte nicht festgestellt werden.

# Lockfinder_Exception_NoProcessesAreLockingThePathSpecified
source: No processes are locking the path specified
de: Kein Prozess sperrt den angegebenen Pfad

# LogWindow_UI_Button_Delete
source: Delete
de: Löschen

# LogWindow_UI_Button_FilterToTab
source: Filter to Tab
de: In Tab filtern

# LogWindow_UI_Button_SaveFilter
source: Save filter
de: Filter speichern

# LogWindow_UI_Button_Search
source: Search
de: Suchen

# LogWindow_UI_Button_ShowAdvanced
source: Show advanced...
de: Erweiterung anzeigen...

# LogWindow_UI_Button_ToolTip_Search
source: Start the filter search
de: Starten des Filters

# LogWindow_UI_CheckBox_AutoHide
source: Auto hide
de: Automatisch verstecken

# LogWindow_UI_CheckBox_FilterTail
source: Filter tail
de: Ende Filtern

# LogWindow_UI_CheckBox_InvertMatch
source: Invert Match
de: Match invertieren

# LogWindow_UI_CheckBox_RangeSearch
source: Range search
de: Bereich durchsuchen

# LogWindow_UI_Label_BackSpread
source: Back Spread
de: Rückstreuung

# LogWindow_UI_Label_ForeSpread
source: Fore Spread
de: Vorwärtsstreuung

# LogWindow_UI_Label_ColumnName
source: Column name:
de: Spaltenname:

# LogWindow_UI_Label_ColumnNames
source: column names
de: Spaltenamen

# LogWindow_UI_StatusText_LoadingFile
source: Loading file...
de: Datei wird geladen...

# LogWindow_UI_StatusText_LoadingWithParameter
source: Loading {0}
de: Laden {0}

# LogWindow_UI_SureToClose
source: Sure to close?
de: Wirklich schließen?

# LogWindow_UI_Text_Frozen
source: Frozen
de: Eingefroren

# LogWindow_UI_Text_ShowAdvancedFilterPanel_HideAdvanced
source: Hide advanced...
de: Erweiterung verstecken...

# LogWindow_UI_Text_ShowAdvancedFilterPanel_ShowAdvanced
source: Show advanced...
de: Erweiterung anzeigen...

# LogWindow_UI_ToolStripMenuItem_Color
source: Color...
de: Farbe...

# LogWindow_UI_ToolStripMenuItem_Copy
source: Copy
de: Kopieren

# Logger_Error_In_Function
source: Error in {0}: {1}
de: Fehler in {0}: {1}

# LogWindow_UI_Button_Column
source: Columns...
de: Spalten...

# LogWindow_UI_Button_ToolTip_Column
source: Choose columns for 'Column restrict'
de: Spalten, für die Restriktion, auswählen

# LogWindow_UI_Button_ToolTip_FilterDown
source: Move the selected entry down in the list
de: Ausgewählten Eintrag nach unten verschieben

# LogWindow_UI_ToolStripMenuItem_ToolTip_ScrollAllTabsToCurrentTimestamp
source: Scolls all open tabs to the selected timestamp, if possible
de: Alle Tabs werden auf den selektierten Zeitstempel verschoben, sofern möglich

# LogWindow_UI_ToolStripMenuItem_ToolTip_MoveToLastColumn
source: Move this column to the last position
de: Verschiebe diese Spalte an die letzte Position

# LogWindow_UI_ToolStripMenuItem_ToolTip_HideColumn
source: Hide this column
de: Verstecke diese Spalte

# LogWindow_UI_ToolStripMenuItem_ToolTip_CopyToNewTab
source: Copy marked lines into a new tab window
de: Kopieren der markierten Zeilen in einen neuen Tab

# LogWindow_UI_ToolStripMenuItem_ToolTip_BookmarkComment
source: Edit the comment for a bookmark
de: Editieren des Lesezeichenkommentars

# LogWindow_UI_ToolStripMenuItem_ToggleBoomark
source: Toggle Boomark
de: Umschalter Lesezeichen

# LogWindow_UI_ToolStripMenuItem_TimeSyncedFiles
source: Time synced files
de: Zeitsynchronisierte Dateien

# LogWindow_UI_ToolStripMenuItem_SetSelectedTextAsBookmarkComment
source: Set selected text as bookmark comment
de: Den markierten Text als Lesezeichenkommentar setzen

# LogWindow_UI_ToolStripMenuItem_SetBookmarksOnSelectedLines
source: Set bookmarks on selected lines
de: Lesezeichen auf markierte Zeile setzen

# LogWindow_UI_ToolStripMenuItem_ScrollToColumn
source: Scroll to column...
de: Zur Spalte scrollen...

# LogWindow_UI_ToolStripMenuItem_ScrollAllTabsToCurrentTimestamp
source: Scroll all tabs to current timestamp
de: Alle Tabs zum aktuellen Zeitstempel scrollen

# LogWindow_UI_ToolStripMenuItem_RestoreColumns
source: Restore columns
de: Spalten wiederherstellen

# LogWindow_UI_ToolStripMenuItem_RemoveAll
source: Remove all
de: Alle entfernen

# LogWindow_UI_ToolStripMenuItem_MoveToLastColumn
source: Move to last column
de: Verschieben zur letzten Spalte

# LogWindow_UI_ToolStripMenuItem_MoveRight
source: Move right
de: Verschieben nach rechts

# LogWindow_UI_ToolStripMenuItem_MoveLeft
source: Move left
de: Verschieben nach links

# LogWindow_UI_ToolStripMenuItem_MarkFilterHitsInLogView
source: Mark filter hits in log view
de: Markiere die getroffenen Filter in der Loganzeige

# LogWindow_UI_ToolStripMenuItem_MarkEditMode
source: Mark/Edit-Mode
de: Markier/Editier Modus

# LogWindow_UI_ToolStripMenuItem_MarkCurrentFilterRange
source: Mark current filter range
de: Markiere den derzeitigen Filterbereich

# LogWindow_UI_ToolStripMenuItem_MakeAllPermanent
source: Make all permanent
de: Alles permanent machen

# LogWindow_UI_ToolStripMenuItem_LocateFilteredLineInOriginalFile
source: Locate filtered line in original file
de: Lokalisiere die gefilterten Zeilen in der originalen Datei

# LogWindow_UI_ToolStripMenuItem_HighlightSelectionInLogFileWordMode
source: Highlight selection in log file (word mode)
de: Markiere die Selektion in der Logdatei (Wörter Modus)

# LogWindow_UI_ToolStripMenuItem_HighlightSelectionInLogFileFullLine
source: Highlight selection in log file (full line)
de: Markiere die Selektion in der Logdatei (Zeilen Modus)

# LogWindow_UI_ToolStripMenuItem_HideColumn
source: Hide column
de: Verstecke Spalte

# LogWindow_UI_ToolStripMenuItem_FreezeLeftColumnsUntilHere
source: Freeze left columns until here
de: Friere alle Spalten von der links markieren bis hier her

# LogWindow_UI_ToolStripMenuItem_FreeThisWindowFromTimeSync
source: Free this window from time sync
de: Befreie das Fenster von der Zeitsynchronisierung

# LogWindow_UI_ToolStripMenuItem_FilterToNewTab
source: Filter to new tab
de: Filtere in einen neuen Tab

# LogWindow_UI_ToolStripMenuItem_FilterForSelection
source: Filter for selection
de: Filter die Markierung

# LogWindow_UI_ToolStripMenuItem_CopyToNewTab
source: Copy to new tab
de: In einen neuen Tab kopieren

# LogWindow_UI_ToolStripMenuItem_CopyToClipboard
source: Copy to clipboard
de: In die Zwischenablage kopieren

# LogWindow_UI_ToolStripMenuItem_BookmarkComment
source: Bookmark comment...
de: Lesezeichenkommentar...

# LogWindow_UI_ToggleBookmark_ThereCommentAttachedRemoveIt
source: There's a comment attached to the bookmark. Really remove the bookmark?
de: An diesem Lesezeichen hängt ein Kommentar. Soll es wirklich gelöscht werden?

# LogWindow_UI_Title_ImportBookmarkList
source: Choose a file to load bookmarks from
de: Wähle eine Datei, aus der die Lesezeichen geladen werden sollen

# LogWindow_UI_Title_ExportBookMarkList
source: Choose a file to save bookmarks into
de: Wähle eine Datei, in die, die Lesezeichen gespeichert werden sollen

# LogWindow_UI_ThereAreSomeCommentsInTheBookmarksReallyRemoveBookmarks
source: There are some comments in the bookmarks. Really remove bookmarks?
de: Es gibt einige Kommentare in den Lesezeichen. Sollen diese wirklich gelöscht werden?

source: Freeze left columns until here ({0})
de: Friere alle Spalten von der links markieren bis hier her ({0})

# LogWindow_UI_StatusLineText_WritePipeToTab_WritingToTempFile
source: Writing to temp file... Press ESC to cancel.
de: Schreiben der Temporären Datei.... ESC drücken um diesen Vorgang abzubrechen.

# LogWindow_UI_StatusLineText_UnexpectedIssueTruncatingFile
source: Unexpected issue truncating file
de: Unbekanntes Problem beim abschneiden der Datei

# LogWindow_UI_StatusLineText_TruncateFailedFileIsLockedByName
source: Truncate failed: file is locked by {0}
de: Abschneiden der Datei ist fehlgeschlagen: Datei ist gesperrt von {0}

# LogWindow_UI_StatusLineText_TimeDiff
source: Time diff is {0}
de: Zeitdifferenz ist {0}

# LogWindow_UI_StatusLineText_SelCountSelectedLines
source: {0} selected lines
de: {0} ausgewählte Zeilen

# LogWindow_UI_StatusLineText_SearchingPressESCToCancel
source: Searching... Press ESC to cancel.
de: Suche... ESC drücken um diesen Vorgang abzubrechen.

# LogWindow_UI_StatusLineText_FilterSearch_Filtering
source: Filtering... Press ESC to cancel.
de: Filterung... ESC drücken um diesen Vorgang abzubrechen.

# LogWindow_UI_StatusLineText_Filter_FilterDurationMs
source: Filter duration: {0} ms.
de: Filterzeit: {0} ms.

# LogWindow_UI_StatusLineText_FileNotFound
source: File not found
de: Datei nicht gefunden

# LogWindow_UI_StatusLineError_StartedFromEndOfFile
source: Started from end of file
de: Gestartet vom Ende der Datei

# LogWindow_UI_StatusLineError_StartedFromBeginningOfFile
source: Started from beginning of file
de: Gestartet vom Anfang der Datei

# LogWindow_UI_StatusLineError_NotFound
source: Not found: {0}
de: Nicht gefunden: {0}

# LogWindow_UI_StatusLineError_InvalidRegularExpression
source: Invalid regular expression
de: Ungültige Regular Expression

# LogWindow_UI_SelectLine_SearchResultNotFound
source: Search result not found
de: Suchresultat nicht gefunden

# LogWindow_UI_SavePersistenceData_ErrorWhileSaving
source: Unexpected error while saving persistence: {0}
de: Unbekannter Fehler beim Speichern der Persistenten Daten: {0}

# LogWindow_UI_LoadFile_CannotLoadFile
source: Cannot load file\n{0}
de: Kann die Datei nicht laden\n{0}

# LogWindow_UI_ListBox_ToolTip_Filter
source: Doubleclick to load a saved filter
de: Doppelklick um den gespeicherten Filter zu laden

# LogWindow_UI_KnobControl_Fuzzy
source: Fuzzy search level (0 = fuzzy off)
de: Fuzzy Suchlevel (0 = fuzzy aus)

# LogWindow_UI_KnobControl_FilterForeSpread
source: Add following lines to search result (Drag up/down, press Shift for finer pitch)
de: Hinzufügen der nachfolgenden Zeilen zum Suchresultat (Nach ob/unten ziehen, Shift drücken für eine feiner Einstellung)

# LogWindow_UI_KnobControl_FilterBackSpread
source: Add preceding lines to search result (Drag up/down, press Shift for finer pitch)
de: Hinzufügen der vorausfolgenden Zeilen zum Suchresultat (Nach ob/unten ziehen, Shift drücken für eine feiner Einstellung)

# LogWindow_UI_ImportExportBookmarkList_Filter
source: CSV file (*.csv)|*.csv|Bookmark file (*.bmk)|*.bmk
de: CSV Datei (*.csv)|*.csv|Lesezeichen Datei (*.bmk)|*.bmk

# LogWindow_UI_Filter_ExceptionWhileFiltering
source: Exception while filtering. Please report to developer: \n\n{0}\n\n{1}
de: Ausnahmefehler während der Filterung. Bitte an den Entwickler weiterleiten: \n\n{0}\n\n{1}

# LogWindow_UI_ErrorWhileImportingBookmarkList
source: Error while importing bookmark list: {0}
de: Fehler während des Imports der Lesezeichenliste: {0}

# LogWindow_UI_ErrorWhileExportingBookmarkList
source: Error while exporting bookmark list: {0}
de: Fehler während des Exports der Lesezeichenliste: {0}

# LogWindow_UI_ComboBox_ToolTip_FilterRange
source: 2nd search string ('end string') when using the range search
de: zweiter Suchtext ('End Text') wenn ein Suchbereich benutzt wird

# LogWindow_UI_ComboBox_ToolTip_Filter
source: Search string for the filter
de: Suchtext für den Filter

# LogWindow_UI_ColumnComboBox_ToolTip
source: Select column to scroll to
de: Auswahl der Spalte zu der gesprungen werden soll

# LogWindow_UI_CheckBox_ToolTip_RangeSearch
source: Enable a special search mode which filters all content between the 2 given search terms.
de: Aktiviere einen speziellen Suchmodus in welchem alles zwischen zwei gegebenen Suchtermen gefiltert wird.

# LogWindow_UI_CheckBox_ToolTip_InvertMatch
source: Invert the search result
de: Invertieren des Suchresultats

# LogWindow_UI_CheckBox_ToolTip_FilterTail
source: Filter tailed file content (keeps filter view up to date on file changes)
de: Filterung des Dateiendes (dadurch wird die Filteranzeige aktuelle gehalten, wenn Dateiänderungen stattfinden)

# LogWindow_UI_CheckBox_ToolTip_FilterSync
source: Sync the current selected line in the filter view to the selection in the log file view
de: Synchronisierung der ausgewählten Zeile in der Filteranzeige zu der Zeile in der Loganzeige

# LogWindow_UI_CheckBox_ToolTip_FilterRegex
source: Use regular expressions. (right-click for RegEx helper window)
de: Benutzen eines regulären Ausdrucks (rechts klick für den RegeEx-Helfer Dialog)

# LogWindow_UI_CheckBox_ToolTip_FilterOnLoad
source: Start immediate filtering after loading a saved filter
de: Sofortiges Filtern nachdem ein gespeicherter Filter geladen wurde

# LogWindow_UI_CheckBox_ToolTip_FilterCaseSensitive
source: Makes the filter case sensitive
de: Macht den Filter Schreibempfindlich (Groß/Kleinschreibung wird beachtet)

# LogWindow_UI_CheckBox_ToolTip_ColumnRestrict
source: Restrict search to columns
de: Schränke die Suche auf die Spalten ein

# LogWindow_UI_CheckBox_ToolTip_AutoHide
source: Hides the filter list after loading a filter
de: Versteckt die Filterliste nachdem die Filter geladen wurden

# LogWindow_UI_CheckBox_FilterCaseSensitive
source: Case sensitive
de: Schreibabhängig

# LogWindow_UI_CheckBox_ColumnRestrict
source: Column restrict
de: Spaltenrestriktion

# LogWindow_UI_Button_ToolTip_ToggleHighlightPanel
source: Open or close a list with saved filters
de: Öffnen oder Schließen einer Liste mit gespeicherten Filter

# LogWindow_UI_Button_ToolTip_ShowAdvanced
source: Toggel the advanced filter options panel
de: Aktivieren/Deaktivieren der Erweiterten Filteranzeige

# LogWindow_UI_Button_ToolTip_FilterUp
source: Move the selected entry up in the list
de: Verschiebe den selektierten Eintrag nach oben

# LogWindow_UI_Button_ToolTip_FilterToTab
source: Launch a new tab with filtered content
de: Öffne einen neuen Tab mit dem gefilterten Bereich

# LogWindow_Logger_Warn_TryToTruncate_UnexpectedIssueTruncatingFileExMessage
source: Unexpected issue truncating file: {0}
de: Unerwartetes Problem beim abschneiden der Datei: {0}

# LogWindow_Logger_Warn_FilterRestore_ColumnizerNameNotFound
source: FilterRestore(): Columnizer {0} not found
de: FilterRestore(): Columnizer {0} nicht gefunden

# LogWindow_Logger_Info_WakeupSignalReceived
source: Wakeup signal received.
de: Aufwachsignal erhalten.

# LogWindow_Logger_Info_WaitingForSignal
source: Waiting for signal
de: Warten auf Signal

# LogWindow_Logger_Info_WaitingForLoadingToBeComplete
source: Waiting for loading to be complete.
de: Warten bis das Laden abgeschlossen ist.

# LogWindow_Logger_Info_UpdateGridNewRowCount
source: UpdateGrid(): new RowCount={0}
de: UpdateGrid(): neue Spaltenanzahl={0}

# LogWindow_Logger_Info_TestStatistic_TestStatisticsCalledWithStartLine
source: TestStatistics() called with start line {0}
de: TestStatistics() aufgerufen mit Startzeile {0}

# LogWindow_Logger_Info_TestStatistic_Ended
source: TestStatistics() ended
de: TestStatistics() beendet

# LogWindow_Logger_Info_StartEditMode_EditControlInLogWindowWasNull
source: Edit control in logWindow was null
de: Dialog im LogWindow war NULL

# LogWindow_Logger_Info_ReloadNewFileCounter_reloadOverloadCounter
source: ReloadNewFile(): counter = {0}
de: ReloadNewFile(): Anzahl = {0}

# LogWindow_Logger_Info_ReloadingFileBecauseItHasBeenRespawned
source: Reloading file because it has been respawned.
de: Datei neu laden, weil diese neu erstellt wurde.

# LogWindow_Logger_Debug_GetTimestampForLineLastLineNumEnter
source: GetTimestampForLine({0}) enter
de: GetTimestampForLine({0}) Funktionsaufruf

# LogWindow_Logger_Debug_GetTimestampForLineLeaveWithLineNumLastLineNum
source: GetTimestampForLine() leave with lineNum={0}
de: GetTimestampForLine() verlasse Funktion mit Zeilennummer ={0}

# LogWindow_Logger_Debug_PreventingReloadBecauseOfRecursiveCalls
source: Preventing reload because of recursive calls.
de: Verhindern des Neuladens aufgrund von Rekursivenaufrufen.

# LogWindow_Logger_Debug_ReloadingInvoked
source: Reloading invoked.
de: Neuladen angeworfen.

# LogWindow_Logger_Debug_SettingColumnizer_currentColumnizerGetName
source: Setting columnizer {0}
de: Einstellungen Columnizer {0}

# LogWindow_Logger_Debug_TestStatistic_DebugInfo_FoundBlock
source: Found block: {0}
de: Gefundener block: {0}

# LogWindow_Logger_Error_ClearFilterList_WhileClearingFilterList
source: Error occured while clearing filter list: {0}
de: Fehler während des Löschens der Filterliste: {0}

# LogWindow_Logger_Error_CloseLogWindow_ErrorWhileDeletingTempFile
source: Error while deleting temp file {0}: {1}
de: Fehler während des Löschens der temporären Datei {0}: {1}

# LogWindow_Logger_Error_ErrorSavingPersistence
source: Error saving persistence: {0}
de: Fehler während des Speicherns der persistierten Daten: {0}

# LogWindow_Logger_Error_InSelectionChangedTrigger_SignalSelcount
source: Error in selectionChangedTrigger_Signal selcount {0}, Exception: {1}
de: Fehler im, selectionChangedTrigger_Signal selcount {0}, Fehlermeldung: {1}

# LogWindow_Logger_Error_InUpdateProgressCallback
source: Error in UpdateProgress Callback: {0}
de: Fehler im UpdateProgress Callback: {0}
