Repository: LogExperts/LogExpert
Catalog: src/LogExpert.Resources/Resources.*.resx
Languages: de

# LogWindow_Logger_Error_LineCountOfEventIsShouldBeGreaterThanLastLineCount
source: Line count of event is: {0}, should be greater than last line count: {1}
de: Zeilenanzahl des Events: {0}, sollte größer als die letzte Zeilenanzahl sein: {1}

# LogWindow_Logger_Info_RefreshingFilterViewBecauseOfReload
source: Refreshing filter view because of reload.
de: Filteranzeige neuladen weil die Filter neugeladen wurden.

# LogWindow_Logger_Info_PersistenceDataForFileNameIsOutdatedItWasDiscarded
source: Persistence data for {0} is outdated. It was discarded.
de: Persistierte Daten {0} sind nicht mehr aktuell. Sind verworfen worden.

# LogWindow_Logger_Info_NoPersistenceDataForFileNameFound
source: No persistence data for {0} found.
de: Keine Persistierten Daten gefunden. {0}.

# LogWindow_Logger_Info_NewFileCreated
source: new File created.
de: neue Datei erstellt.

# LogWindow_Logger_Info_MultiThreadedFilter_Duration
source: Multi threaded filter duration: {0} ms.
de: Zeit der Multi-Thread Filterung {0} in ms.

# LogWindow_Logger_Info_LoadFilesAsMulti_FileName
source: LoadFilesAsMulti: File: {0}
de: LoadFilesAsMulti: Datei: {0}

# LogWindow_Logger_Info_LoadFile_PickedNewColumnizer
source: Picked new columnizer {0}
de: Neuer Columnizer ausgewählt: {0}

# LogWindow_Logger_Info_LoadFile_LoadingLogfile
source: Loading logfile: {0}
de: Laden der Logdatei: {0}

# LogWindow_Logger_Info_HandlingFileNotFoundEvent
source: Handling file not found event.
de: Datei nicht gefunden Event wird behandelt.

# LogWindow_Logger_Info_GotFileSizeChangedEventPrevLines0CurrLines1
source: Got FileSizeChanged event. prevLines:{0}, curr lines: {1}
de: Dateigröße hat sich geändert. prevLines:{0}, curr lines: {1}

# LogWindow_Logger_Info_FreeFromTimeSync_DeSyncingWindow
source: De-Syncing window for {0}
de: Desynchronisierung des Fensters {0}

# LogWindow_Logger_Info_FinishedLoading
source: Finished loading.
de: Laden erledigt.

# LogWindow_Logger_Info_Filter_SingleThreadedFilterDuration
source: Single threaded filter duration: {0} ms.
de: Zeit der Single-Thread Filterung {0} in ms.

# LogWindow_Logger_Info_FileLoadingComplete
source: File loading complete.
de: Datei laden erledigt.

# LogWindow_Logger_Info_EventsInQueue
source: {0} events in queue
de: {0} Events in der Warteschlange

# LogWindow_Logger_Info_DetectedMultiFileNameListInPersistenceOptions
source: Detected MultiFile name list in persistence options
de: MultiDateiname in den Persistierten Daten gefunden

# LogWindow_Logger_Info_CloseLogWindow_DeletingTempFile
source: Deleting temp file {0}
de: Löschen der temporären Datei {0}

# LogWindow_Logger_Info_AddToTimeSync_SyncingWindow
source: Syncing window for {0} to {1}
de: Synchronisierung des Fenster von {0} zu {1}

# LogWindow_Logger_Error_WhileResizingColumns
source: Error while resizing columns: {0}
de: Fehler während der Vergrößerung der Spalten {0}

# LogWindow_Logger_Error_SettingSplitterDistance
source: Error setting splitter distance: {0}
de: Fehler während die Splitterdistanz verändert wurde {0}

# LogWindow_Logger_Error_SelectLine_WhileSelectingLine
source: Error while selecting line: {0}
de: Fehler während des selektierens der Zeile: {0}

# LogWindow_Logger_Error_LoadingStartedCallback
source: Error LoadingStarted Callback: {0}
de: Fehler im LoadingStarted Callback {0}

# LogWindow_Logger_Error_LoadingPersistenceData
source: Error loading persistence data: {0}
de: Fehler während des Ladens der persistierten Daten {0}

# LogWindow_Logger_Error_LoadingBookmarks
source: Error loading bookmarks: {0}
de: Fehler während des Ladens der Lesezeichen {0}

# LogTabWindow_Logger_Error_RegExErrorWhileFindingColumnizer
source: RegEx-error while finding columnizer: {0}
de: RegEx-Fehler während der Suche eines Columnizers: {0}

# LogTabWindow_UI_LogWindow_ToolTip_InvertMatch
source: (Invert match)
de: (Invertiere Match)

# LogTabWindow_UI_LogWindow_Tooltip_ColumnRestrict
source: \nColumn restrict
de: \nSpalten restriktion

# LogTabWindow_UI_LogWindow_Title_Text_From_Clipboard
source: Clipboard
de: Zwischenablage

# LogTabWindow_UI_LogWindow_Title_ToolTip_PastedOn
source: Pasted on {0}
de: Eingfügt am {0}

# LogTabWindow_Logger_Warn_EncodingIsNotValid
source: Encoding {0} is not a valid encoding
de: Encoding {0} ist nicht valide

# LogExpert_Common_Error_InsufficientRights_For_Parameter_ErrorMessage
source: Insufficient rights {0}: {1}
de: Unzureichende Rechte {0}: {1}

# LogExpert_Common_Error_5Parameters_ErrorDuring0Value1Min2Max3Visible45
source: Error during {0} value {1}, min {2}, max {3}, visible {4}: {5}
de: Fehler während {0} value {1}, min {2}, max {3}, visible {4}: {5}

# LogTabWindow_StatusLineText_lowerCase_Lines
source: lines
de: linien

# LogTabWindow_StatusLineText_UpperCase_Lines
source: Line
de: Linien

# LogTabWindow_Logger_Warn_ThePreferencesHaveChanged
source: The preferences have changed
de: Die Einstellungen haben sich geändert

# LogTabWindow_Logger_Info_StartingExternalToolWithSysoutRedirection
source: Starting external tool with sysout redirection: {0} {1}
de: Starten eines externen Tools mit sysout Redirektion: {0} {1}

# LogTabWindow_Logger_Info_StartingExternalTool
source: Starting external tool: {0} {1}
de: Starten eines externen Tools: {0} {1}

# LogTabWindow_ThrowTestException_ThisIsATestExceptionThrownByAnAsyncDelegate
source: This is a test exception thrown by an async delegate
de: Das ist eine Test Fehlermeldung, geworfen durch einen Async Delegate

source: This is a test exception thrown by a background thread
de: Das ist eine Test Fehlermeldung, geworfen durch einen Hintergrund Thread

source: Layout data contains non-existing LogWindow for {0}
de: Layoutdaten besitz ein nicht existierendes LogWindow für {0}

source: Dragging something over LogExpert. Formats:
de: Über Logexpert etwas ziehen. Formate:

# LogTabWindow_Logger_Debug_OnLogWindowDragDrop_DroppedFormats
source: Dropped formats:
de: Fallengelassene Formate:

source: Received SyncModeChanged event while disposing. Event ignored.
de: Ein SyncModeChanged Event erhalten während Disposed wurde. Event wird Ignoriert.

source: This is a test exception thrown by the GUI thread
de: Das ist eine Test Fehlermeldung, geworfen durch den GUI Thread
